  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-nat-gw` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/21ac774b-5e64-4a43-a4a1-e41f39578eb8/terraform-bin apply -no-color -auto-approve -compact-warnings

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

# azurerm_network_interface.servers[0] has been deleted
- resource "azurerm_network_interface" "servers" {
    - applied_dns_servers           = [] -> null
    - dns_servers                   = [] -> null
    - enable_accelerated_networking = false -> null
    - enable_ip_forwarding          = false -> null
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-0" -> null
    - internal_domain_name_suffix   = "ifatwhs3bgpu5ljl3uylxrs2xc.bx.internal.cloudapp.net" -> null
    - location                      = "eastus" -> null
    - name                          = "server-nic-0" -> null
    - private_ip_address            = "10.0.1.6" -> null
    - private_ip_addresses          = [
        - "10.0.1.6",
      ] -> null
    - resource_group_name           = "org-jcetina-repo-baklava-rg" -> null

    - ip_configuration {
        - name                          = "internal" -> null
        - primary                       = true -> null
        - private_ip_address            = "10.0.1.6" -> null
        - private_ip_address_allocation = "Dynamic" -> null
        - private_ip_address_version    = "IPv4" -> null
        - subnet_id                     = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet" -> null
      }
  }

# azurerm_network_interface.servers[1] has been deleted
- resource "azurerm_network_interface" "servers" {
    - applied_dns_servers           = [] -> null
    - dns_servers                   = [] -> null
    - enable_accelerated_networking = false -> null
    - enable_ip_forwarding          = false -> null
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-1" -> null
    - internal_domain_name_suffix   = "ifatwhs3bgpu5ljl3uylxrs2xc.bx.internal.cloudapp.net" -> null
    - location                      = "eastus" -> null
    - name                          = "server-nic-1" -> null
    - private_ip_address            = "10.0.1.5" -> null
    - private_ip_addresses          = [
        - "10.0.1.5",
      ] -> null
    - resource_group_name           = "org-jcetina-repo-baklava-rg" -> null

    - ip_configuration {
        - name                          = "internal" -> null
        - primary                       = true -> null
        - private_ip_address            = "10.0.1.5" -> null
        - private_ip_address_allocation = "Dynamic" -> null
        - private_ip_address_version    = "IPv4" -> null
        - subnet_id                     = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet" -> null
      }
  }

# module.server_subnet.azurerm_subnet.subnet has been deleted
- resource "azurerm_subnet" "subnet" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet" -> null
      name                                           = "ServerSubnet"
      # (7 unchanged attributes hidden)
  }

# module.vnet.azurerm_firewall_policy.policy has been deleted
- resource "azurerm_firewall_policy" "policy" {
    - id                       = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/firewallPolicies/my-secure-policy" -> null
      name                     = "my-secure-policy"
      tags                     = {}
      # (8 unchanged attributes hidden)
  }

# module.vnet.azurerm_virtual_network.vnet has been deleted
- resource "azurerm_virtual_network" "vnet" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet" -> null
    - location                = "eastus" -> null
    - name                    = "my-secure-vnet" -> null
    - resource_group_name     = "org-jcetina-repo-baklava-rg" -> null
      tags                    = {}
      # (5 unchanged attributes hidden)
  }

# module.vnet.module.bastion_ip.azurerm_public_ip.public_ip has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-vnet-bastion-ip" -> null
    - ip_address              = "40.76.55.38" -> null
      name                    = "my-secure-vnet-bastion-ip"
      # (7 unchanged attributes hidden)
  }

# module.vnet.module.bastion_subnet.azurerm_subnet.subnet has been deleted
- resource "azurerm_subnet" "subnet" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureBastionSubnet" -> null
      name                                           = "AzureBastionSubnet"
      # (5 unchanged attributes hidden)
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway has been deleted
- resource "azurerm_nat_gateway" "nat_gateway" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/natGateways/my-secure-nat-gw" -> null
      name                    = "my-secure-nat-gw"
      tags                    = {}
      # (6 unchanged attributes hidden)
  }

# module.vnet.module.route_table.azurerm_route_table.route_table has been deleted
- resource "azurerm_route_table" "route_table" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/my-secure-route-table" -> null
      name                          = "my-secure-route-table"
      tags                          = {}
      # (5 unchanged attributes hidden)
  }

# module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-firewall-ip" -> null
    - ip_address              = "20.228.253.153" -> null
      name                    = "my-secure-firewall-ip"
      tags                    = {}
      # (9 unchanged attributes hidden)
  }

# module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1" -> null
    - ip_address              = "20.228.253.83" -> null
      name                    = "my-secure-nat-gw-public-ip-1"
      tags                    = {}
      # (9 unchanged attributes hidden)
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_linux_virtual_machine.servers[0] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# azurerm_linux_virtual_machine.servers[1] will be created
+ resource "azurerm_linux_virtual_machine" "servers" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server-1"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# azurerm_network_interface.servers[0] will be created
+ resource "azurerm_network_interface" "servers" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus"
    + mac_address                   = (known after apply)
    + name                          = "server-nic-0"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + subnet_id                                          = (known after apply)
      }
  }

# azurerm_network_interface.servers[1] will be created
+ resource "azurerm_network_interface" "servers" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus"
    + mac_address                   = (known after apply)
    + name                          = "server-nic-1"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + subnet_id                                          = (known after apply)
      }
  }

# azurerm_subnet_route_table_association.server_subnet_association will be created
+ resource "azurerm_subnet_route_table_association" "server_subnet_association" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.server_subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.1.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "ServerSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.azurerm_bastion_host.bastion will be created
+ resource "azurerm_bastion_host" "bastion" {
    + copy_paste_enabled     = true
    + dns_name               = (known after apply)
    + file_copy_enabled      = false
    + id                     = (known after apply)
    + ip_connect_enabled     = false
    + location               = "eastus"
    + name                   = "my-secure-vnet-bastion"
    + resource_group_name    = "org-jcetina-repo-baklava-rg"
    + scale_units            = 2
    + shareable_link_enabled = false
    + sku                    = "Basic"
    + tunneling_enabled      = false

    + ip_configuration {
        + name                 = "bastion-config"
        + public_ip_address_id = (known after apply)
        + subnet_id            = (known after apply)
      }
  }

# module.vnet.azurerm_firewall_policy.policy will be created
+ resource "azurerm_firewall_policy" "policy" {
    + child_policies           = (known after apply)
    + firewalls                = (known after apply)
    + id                       = (known after apply)
    + location                 = "eastus"
    + name                     = "my-secure-policy"
    + resource_group_name      = "org-jcetina-repo-baklava-rg"
    + rule_collection_groups   = (known after apply)
    + sku                      = (known after apply)
    + threat_intelligence_mode = "Alert"
  }

# module.vnet.azurerm_subnet_nat_gateway_association.firewall_association will be created
+ resource "azurerm_subnet_nat_gateway_association" "firewall_association" {
    + id             = (known after apply)
    + nat_gateway_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vnet.azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-vnet"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.vnet.module.bastion_ip.azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-vnet-bastion-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

# module.vnet.module.bastion_subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.2.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "AzureBastionSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.module.firewall.azurerm_firewall.firewall will be created
+ resource "azurerm_firewall" "firewall" {
    + firewall_policy_id  = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-firewall"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku_name            = "AZFW_VNet"
    + sku_tier            = "Standard"
    + threat_intel_mode   = (known after apply)

    + ip_configuration {
        + name                 = "my-secure-firewall-ip-config"
        + private_ip_address   = (known after apply)
        + public_ip_address_id = (known after apply)
        + subnet_id            = (known after apply)
      }
  }

# module.vnet.module.firewall_subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.0.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "AzureFirewallSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway will be created
+ resource "azurerm_nat_gateway" "nat_gateway" {
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + location                = "eastus"
    + name                    = "my-secure-nat-gw"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + resource_guid           = (known after apply)
    + sku_name                = "Standard"
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"] will be created
+ resource "azurerm_nat_gateway_public_ip_association" "association" {
    + id                   = (known after apply)
    + nat_gateway_id       = (known after apply)
    + public_ip_address_id = (known after apply)
  }

# module.vnet.module.route_table.azurerm_route_table.route_table will be created
+ resource "azurerm_route_table" "route_table" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "eastus"
    + name                          = "my-secure-route-table"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "0.0.0.0/0"
            + name                   = "ToFirewall"
            + next_hop_in_ip_address = (known after apply)
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "VnetRoute"
            + next_hop_in_ip_address = ""
            + next_hop_type          = "VnetLocal"
          },
      ]
    + subnets                       = (known after apply)
  }

# module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-firewall-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

# module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-nat-gw-public-ip-1"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

Plan: 19 to add, 0 to change, 0 to destroy.
module.vnet.azurerm_virtual_network.vnet: Creating...
module.vnet.azurerm_virtual_network.vnet: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet]
module.vnet.module.firewall_subnet.azurerm_subnet.subnet: Creating...
module.vnet.module.bastion_subnet.azurerm_subnet.subnet: Creating...
module.server_subnet.azurerm_subnet.subnet: Creating...
module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip: Creating...
module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway: Creating...
module.vnet.module.bastion_ip.azurerm_public_ip.public_ip: Creating...
module.vnet.azurerm_firewall_policy.policy: Creating...
module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip: Creating...
module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1]
module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-firewall-ip]
module.vnet.module.bastion_ip.azurerm_public_ip.public_ip: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-vnet-bastion-ip]
module.vnet.module.bastion_subnet.azurerm_subnet.subnet: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureBastionSubnet]
module.vnet.azurerm_bastion_host.bastion: Creating...
module.server_subnet.azurerm_subnet.subnet: Creation complete after 10s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet]
azurerm_network_interface.servers[0]: Creating...
azurerm_network_interface.servers[1]: Creating...
module.vnet.module.firewall_subnet.azurerm_subnet.subnet: Still creating... [10s elapsed]
module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway: Still creating... [10s elapsed]
module.vnet.azurerm_firewall_policy.policy: Still creating... [10s elapsed]
module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway: Creation complete after 13s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/natGateways/my-secure-nat-gw]
module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"]: Creating...
module.vnet.azurerm_firewall_policy.policy: Creation complete after 14s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/firewallPolicies/my-secure-policy]
module.vnet.module.firewall_subnet.azurerm_subnet.subnet: Creation complete after 14s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Creating...
module.vnet.module.firewall.azurerm_firewall.firewall: Creating...
module.vnet.azurerm_bastion_host.bastion: Still creating... [10s elapsed]
azurerm_network_interface.servers[0]: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-0]
azurerm_network_interface.servers[1]: Creation complete after 7s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/server-nic-1]
azurerm_linux_virtual_machine.servers[0]: Creating...
azurerm_linux_virtual_machine.servers[1]: Creating...
module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"]: Still creating... [10s elapsed]
module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"]: Creation complete after 11s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/natGateways/my-secure-nat-gw|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [10s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [10s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [20s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [10s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [10s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [20s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [20s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [30s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [20s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [20s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [30s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [30s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [40s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [30s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [30s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [40s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [40s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [50s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [40s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [40s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [50s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [50s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [1m0s elapsed]
azurerm_linux_virtual_machine.servers[0]: Still creating... [50s elapsed]
azurerm_linux_virtual_machine.servers[1]: Still creating... [50s elapsed]
azurerm_linux_virtual_machine.servers[0]: Creation complete after 51s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-0]
azurerm_linux_virtual_machine.servers[1]: Creation complete after 51s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/server-1]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [1m0s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m0s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [1m10s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [1m10s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m10s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [1m20s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [1m20s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m20s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [1m30s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [1m30s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m30s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [1m40s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [1m40s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m40s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [1m50s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [1m50s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m50s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [2m0s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [2m0s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [2m0s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [2m10s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [2m10s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [2m10s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [2m20s elapsed]
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [2m20s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [2m20s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [2m30s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Creation complete after 2m27s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/azureFirewalls/my-secure-firewall]
module.vnet.module.route_table.azurerm_route_table.route_table: Creating...
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Still creating... [2m30s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [2m40s elapsed]
module.vnet.module.route_table.azurerm_route_table.route_table: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/my-secure-route-table]
azurerm_subnet_route_table_association.server_subnet_association: Creating...
module.vnet.azurerm_subnet_nat_gateway_association.firewall_association: Creation complete after 2m32s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet]
azurerm_subnet_route_table_association.server_subnet_association: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet]
module.vnet.azurerm_bastion_host.bastion: Still creating... [2m50s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [3m0s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [3m10s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [3m20s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [3m30s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [3m40s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [3m50s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [4m0s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [4m10s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [4m20s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [4m30s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [4m40s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [4m50s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [5m0s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [5m10s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [5m20s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [5m30s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [5m40s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [5m50s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [6m0s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [6m10s elapsed]
module.vnet.azurerm_bastion_host.bastion: Still creating... [6m20s elapsed]
module.vnet.azurerm_bastion_host.bastion: Creation complete after 6m28s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/bastionHosts/my-secure-vnet-bastion]

Apply complete! Resources: 19 added, 0 changed, 0 destroyed.
```

  </details>